## 1

In [1]:
import pandas as pd #importing the libraray.

In [2]:
myDF= pd.read_csv('/anvil/projects/tdm/data/death_records/DeathRecords.csv') #loading the dataset

In [3]:
myDF.head() #print the dataset head

,Id,ResidentStatus,Education1989Revision,Education2003Revision,EducationReportingFlag,MonthOfDeath,Sex,AgeType,Age,AgeSubstitutionFlag,...,CauseRecode39,NumberOfEntityAxisConditions,NumberOfRecordAxisConditions,Race,BridgedRaceFlag,RaceImputationFlag,RaceRecode3,RaceRecode5,HispanicOrigin,HispanicOriginRaceRecode
0,1,1,0,2,1,1,M,1,87,0,...,24,1,1,1,0,0,1,1,100,6
1,2,1,0,2,1,1,M,1,58,0,...,21,3,3,1,0,0,1,1,100,6
2,3,1,0,7,1,1,F,1,75,0,...,28,2,2,1,0,0,1,1,100,6
3,4,1,0,6,1,1,M,1,74,0,...,22,3,3,1,0,0,1,1,100,6
4,5,1,0,3,1,1,M,1,64,0,...,21,1,1,1,0,0,1,1,100,6

Part a

In [4]:
def makeatable (myseries: pd.Series) -> pd.Series:
    """
    The makeatable function takes a Pandas Series as input,
    with any type of data in the Series (for instance, it might be a column of a data frame)
    and returns the percentages of the data of each type.

    Args:
    myseries (pd.Series): This is any type of Series that we want to study,

    Returns:
    makeatable (pd.Series): This is a Pandas Series with the percentages of the data of each type.
    """
    mypercentages = myseries.value_counts(normalize = True)
    return mypercentages
#from the question defining the makeatable function.

In [5]:
makeatable(myDF['Education2003Revision']) #example from the ques.

Education2003Revision
3    0.382360
4    0.110160
1    0.105759
2    0.098563
0    0.091825
6    0.089054
5    0.053263
7    0.035191
9    0.019005
8    0.014820
Name: proportion, dtype: float64

In [6]:
makeatable(myDF['Sex'])
#Using the makeatable function to display table of values from the Sex column

Sex
M    0.506034
F    0.493966
Name: proportion, dtype: float64

In [7]:
#tried another method from geeksforgeeks

sex_percentages = makeatable(myDF['Sex'])
print(sex_percentages)

#Using the makeatable function to display table of values from 
#the Sex column and printing the result.

Sex
M    0.506034
F    0.493966
Name: proportion, dtype: float64

Part b

In [8]:
makeatable(myDF['MaritalStatus'])

MaritalStatus
M    0.372464
W    0.341460
D    0.152388
S    0.126576
U    0.007112
Name: proportion, dtype: float64

In [9]:
#another method. 

marital_status_percentages = makeatable(myDF['MaritalStatus'])
print(marital_status_percentages)
#Use the makeatable function to display table of values from the MaritalStatus 
#column and printing the result.

MaritalStatus
M    0.372464
W    0.341460
D    0.152388
S    0.126576
U    0.007112
Name: proportion, dtype: float64

## 2

In [10]:
def teenagecount (myseries: pd.Series) -> int:
    """
    The teenagecount function takes a Pandas Series as input,
    with any type of data in the Series (for instance, it might be a column of a data frame)
    and returns the number of data points that are between 13 and 19 (inclusive).

    Args:
    myseries (pd.Series): This is any type of Series that we want to study,

    Returns:
    teenagecount (int): This is an integer that shows the number of values between 13 and 19 in the data.
    """
    teenagecount = len(myseries[(myseries >= 13) & (myseries <= 19)])
    return teenagecount

Part a

In [11]:
myDF = pd.read_csv('/anvil/projects/tdm/data/death_records/DeathRecords.csv')
#loding the dataset

In [12]:
myDF.head() #printing the datatset

,Id,ResidentStatus,Education1989Revision,Education2003Revision,EducationReportingFlag,MonthOfDeath,Sex,AgeType,Age,AgeSubstitutionFlag,...,CauseRecode39,NumberOfEntityAxisConditions,NumberOfRecordAxisConditions,Race,BridgedRaceFlag,RaceImputationFlag,RaceRecode3,RaceRecode5,HispanicOrigin,HispanicOriginRaceRecode
0,1,1,0,2,1,1,M,1,87,0,...,24,1,1,1,0,0,1,1,100,6
1,2,1,0,2,1,1,M,1,58,0,...,21,3,3,1,0,0,1,1,100,6
2,3,1,0,7,1,1,F,1,75,0,...,28,2,2,1,0,0,1,1,100,6
3,4,1,0,6,1,1,M,1,74,0,...,22,3,3,1,0,0,1,1,100,6
4,5,1,0,3,1,1,M,1,64,0,...,21,1,1,1,0,0,1,1,100,6

In [13]:
teen_count = teenagecount(myDF['Age'])
#Using the fucntion

In [14]:
print("Number of teenagers:", teen_count)
#printing the output

Number of teenagers: 12643

Part b

In [15]:
myDF = pd.read_csv('/anvil/projects/tdm/data/olympics/athlete_events.csv') 
#loding the dataset

In [16]:
myDF.head() #printing the datatset

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [17]:
teen_count = teenagecount(myDF['Age'])
print("Olympics Athlete Events data:", teen_count)
#Apply the function to the Age and printing the result.

Olympics Athlete Events data: 32250

## 3

In [18]:
import pandas as pd #importing library

In [19]:
def longesttest (mydata: pd.Series) -> str:
    """
    The longesttest function takes a Pandas Series as input,
    containing strings, and returns the longest string.

    Args:
    mydata (pd.Series): This is any type of Series that contains strings which we want to study,

    Returns:
    mylongeststring (str): This is the longest of the strings in the Pandas Series
    """
    mylongeststring = max(mydata, key=len)
    return mylongeststring

In [20]:
myDF= pd.read_csv('/anvil/projects/tdm/data/beer/reviews_sample.csv') #loading the data

In [21]:
myDF.head() #printing the data from the dataste

,beer_id,username,date,text,look,smell,taste,feel,overall,score
0,271781,bluejacket74,2017-03-17,"750 ml bottle, 2016 vintage, bottle #304 of...",4.00,4.00,4.00,4.25,4.00,4.03
1,125646,_dirty_,2017-12-21,,4.50,4.50,4.50,4.50,4.50,4.50
2,125646,CJDUBYA,2017-12-21,,4.75,4.75,4.75,4.75,4.75,4.75
3,125646,GratefulBeerGuy,2017-12-20,0% 16 oz can. Funny story: As I finally wal...,4.75,4.75,4.50,4.50,4.50,4.58
4,125646,LukeGude,2017-12-20,Classic TH NEIPA. Overflowing head and bouq...,4.25,4.50,4.25,4.25,4.25,4.31

Part a

In [22]:
longest_review = longesttest(myDF['text'])
#Finding the longest review in the text column of beer reviews

In [23]:
print("Longest review in the beer reviews dataset:\n", longest_review)
#printing the result

Longest review in the beer reviews dataset:
    At long last, Speakeasy has begun to put their beers into CANs! The graphics rock, although the verbiage is gone. Such is the price that The CANQuest (tm) must pay. A CAN review: Jesus! The tab fought me to the point that I thought that it was going to snap off before I could get the vent to Crack! Once it let go, I gave it an inverted Glug, crating two-plus fingers of dense, rocky, tawny head with decent retention. Color was an oh-so-slightly hazy solid Amber (SRM = > 7, < 9). Nose had a wild mintiness and nothing else. Did they include malt? Wow! Mouthfeel was big, thick & heavy, just laying lazily on my tongue. The taste was like pine resin. Jayzus! Nothing but PACNW hops. Phew! Finish was dry and even kind of mellow. I may need a lie-down after this. I have been recently inspired to review as many of the Speakeasy family of beers as possible, all the while imagining that I have been transported back in time to the Prohibition era in the United States. When I left off, I had been dallying with both Scarlett and Tallulah, the molls of Big Daddy and his brother, Double Daddy, respectively. From the bottle: "San Francisco born & brewed"; "Doubling down on malt and hops, Double Daddy raises the stakes. With its good looks and no-limit style, Double Daddy takes the pot every time."; "Legit since 1997"; "Independently owned & operated". Where Big Daddy got his Swiss mother's blonde hair and skin tone, his older brother, Double Daddy looked like he was straight out of downtown Palermo by comparison. He bade me sit down and he shuffled the cards as I poured. His eyebrows raised in a rare show of any kind of emotion as the head came right to the top of the glass before beginning to settle. The end result was two dense, rocky fingers of tawny head with great retention. Double Daddy lowered his head to signify that he wanted me to cut the cards while we waited. Double Daddy is a man of few words, preferring to let his deep-amber color (SRM = > 9, < 13) with its NE-quality clarity speak for itself. I always default to Double Daddy as holding the King of Hearts, since that is how he fancies himself. I will grant you that he is better to Tallulah than Big Daddy is to Scarlett, but he must be lacking something for her to be stepping out with me. Damned if I know what it is though, as the nose smells like a pine forest on a winter's day - cool, minty and resinous. I took my first draught and he reached over, prised my mouth open, pulled out my tongue and began beating it insensate! Jeez-O, man, this was one no-playing-around beer. The hops were unrelenting, beating and scrubbing at my poor, bruised tongue, leaving no question that it was a DIPA in my glass. Double Daddy stopped, reached up and removed his cigar from his mouth and asked, "Yer call. Ya wanna raise, check, or fold?" I suddenly realized that the smart play would be to fold and get the hell outta town, leaving him and his equally psycho brother and their women in my wake. Nobody ever accused me of being smart, so I raised and sat back, eyes watering. "Why are you still here?" asked Double Daddy, doubling down so that my next move would be all-in. "I like it here, Double Daddy," I replied. "People treat me real nice, plus I'm making some decent bank doing this 'n' 'at, here 'n' 'ere." He nodded and then asked a question that chilled me to my core, "Aincha afraid that one of those many twists that yer seein' is gonna blab, either to one of their own or to their old man?" I raised my glass as a toast, unable to speak as my throat was constricted tighter than the feather boa Scarlett wore last night. Double Daddy snorted and I pushed all of my chips to the center of the table. He placed his hand on the table with a big grin, two pair, including the King of Hearts and its partner, the King of Diamonds, fitting since he always sported a big diamond on his right pinky. His smile quickly faded like the rest of the beer in my glass when I revealed a Full House, all Spades. He spat out his stogie, threw a wad of bills at me and told me to get out. I did, but the bitterness he had produced was going to stay with me for a while. I had some of this on tap last night at Arena B & G in Wilkes-Barre and it was deeelishus! Knowing that I had a bottle in my refrigerator at home, I decided to make it my first beer upon my return. It poured with two fingers' worth of an eggshell-white head. The head also produced some great sticky lacing from top to bottom in the glass. The beer's color was a slightly hazy deep-amber. The nose was huge with hops - wet, floral, spicy, citrusy, just mouthwatering. The mouthfeel was full and almost thick. The taste was very hoppy from the outset to the finish, but it was not as sharp as what I had on tap last night. That is why I prefer to review tap beers, vice out of a bottle - draft is as fresh as it can be. Even so, I can envision myself cracking open another bottle of this in conjunction with some bleu cheese and crusty bread.

In [24]:
#another method
longest_beer_review = longesttest(myDF['text'])
print("Longest beer review (first 200 chars):", longest_beer_review[:200], "...")

Longest beer review (first 200 chars):    At long last, Speakeasy has begun to put their beers into CANs! The graphics rock, although the verbiage is gone. Such is the price that The CANQuest (tm) must pay. A CAN review: Jesus! The tab fou ...

Part b

In [25]:
#Define the funtion from the question
def mystatesum (mystate: str) -> float:
    """
    The mystatesum function takes a string as input,
    specifying the 2-character abbreviation of the state where we sum the dollar amounts of the donations,
    and returns a floating point number that specifies the total dollar amount donated in that state.

    Args:
    mystate (str): This is a string as input,
    specifying the 2-character abbreviation of the state where we sum the dollar amounts of the donations

    Returns:
    mydollars (float): This is a floating point number that specifies
    the total dollar amount donated in that state.
    """
    myDF = pd.read_csv("/anvil/projects/tdm/data/election/itcont1980.txt", header=None, sep='|')
    myDF.columns = ["CMTE_ID", "AMNDT_IND", "RPT_TP", "TRANSACTION_PGI", "IMAGE_NUM", "TRANSACTION_TP", "ENTITY_TP", "NAME", "CITY", "STATE", "ZIP_CODE", "EMPLOYER", "OCCUPATION", "TRANSACTION_DT", "TRANSACTION_AMT", "OTHER_ID", "TRAN_ID", "FILE_NUM", "MEMO_CD", "MEMO_TEXT", "SUB_ID"]
    mydollars = myDF[myDF['STATE'] == mystate]['TRANSACTION_AMT'].sum()
    return mydollars

In [26]:
myDF.head()

,beer_id,username,date,text,look,smell,taste,feel,overall,score
0,271781,bluejacket74,2017-03-17,"750 ml bottle, 2016 vintage, bottle #304 of...",4.00,4.00,4.00,4.25,4.00,4.03
1,125646,_dirty_,2017-12-21,,4.50,4.50,4.50,4.50,4.50,4.50
2,125646,CJDUBYA,2017-12-21,,4.75,4.75,4.75,4.75,4.75,4.75
3,125646,GratefulBeerGuy,2017-12-20,0% 16 oz can. Funny story: As I finally wal...,4.75,4.75,4.50,4.50,4.50,4.58
4,125646,LukeGude,2017-12-20,Classic TH NEIPA. Overflowing head and bouq...,4.25,4.50,4.25,4.25,4.25,4.31

In [27]:
#Finding the longest name in the NAME column of the 1980 election data
longest_name = longesttest(myDF['username'].astype(str))

In [28]:
#to display the result.
print("\nLongest name in the 1980 election dataset:\n", longest_name)

Longest name in the 1980 election dataset:
 Cantstopwontstopluclongly

## 4

In [29]:
import pandas as pd

Part a

In [30]:
# Define the function
def mostpopulardate(myseries: pd.Series):
    """
    The mostpopulardate function takes a Pandas Series as input,
    containing dates, and returns the most frequent date along with its occurrence count.

    Args:
    myseries (pd.Series): A Pandas Series containing date values.

    Returns:
    tuple: The most frequent date and its count.
    """
    most_common_date = myseries.value_counts().idxmax()  # Finds the most frequent date
    count = myseries.value_counts().max()  # Finds how many times it occurs
    return most_common_date, count

Part b

In [31]:
myDF = pd.read_csv('/anvil/projects/tdm/data/beer/reviews_sample.csv')

In [32]:
myDF.head()

,beer_id,username,date,text,look,smell,taste,feel,overall,score
0,271781,bluejacket74,2017-03-17,"750 ml bottle, 2016 vintage, bottle #304 of...",4.00,4.00,4.00,4.25,4.00,4.03
1,125646,_dirty_,2017-12-21,,4.50,4.50,4.50,4.50,4.50,4.50
2,125646,CJDUBYA,2017-12-21,,4.75,4.75,4.75,4.75,4.75,4.75
3,125646,GratefulBeerGuy,2017-12-20,0% 16 oz can. Funny story: As I finally wal...,4.75,4.75,4.50,4.50,4.50,4.58
4,125646,LukeGude,2017-12-20,Classic TH NEIPA. Overflowing head and bouq...,4.25,4.50,4.25,4.25,4.25,4.31

In [33]:
myDF['date'] = pd.to_datetime(myDF['date'], errors='coerce')
# Convert date column to datetime format

In [34]:
most_popular_beer_date, beer_date_count = mostpopulardate(myDF['date'])
# Applying the functio

In [35]:
print(f"Most popular date in beer reviews data: {most_popular_beer_date}, occurred {beer_date_count} times.")
#printing the result

Most popular date in beer reviews data: 2011-11-15 00:00:00, occurred 1497 times.

Part c

In [36]:
#Define the funtion from the question
def mystatesum (mystate: str) -> float:
    """
    The mystatesum function takes a string as input,
    specifying the 2-character abbreviation of the state where we sum the dollar amounts of the donations,
    and returns a floating point number that specifies the total dollar amount donated in that state.

    Args:
    mystate (str): This is a string as input,
    specifying the 2-character abbreviation of the state where we sum the dollar amounts of the donations

    Returns:
    mydollars (float): This is a floating point number that specifies
    the total dollar amount donated in that state.
    """
    myDF = pd.read_csv("/anvil/projects/tdm/data/election/itcont1980.txt", header=None, sep='|')
    myDF.columns = ["CMTE_ID", "AMNDT_IND", "RPT_TP", "TRANSACTION_PGI", "IMAGE_NUM", "TRANSACTION_TP", "ENTITY_TP", "NAME", "CITY", "STATE", "ZIP_CODE", "EMPLOYER", "OCCUPATION", "TRANSACTION_DT", "TRANSACTION_AMT", "OTHER_ID", "TRAN_ID", "FILE_NUM", "MEMO_CD", "MEMO_TEXT", "SUB_ID"]
    mydollars = myDF[myDF['STATE'] == mystate]['TRANSACTION_AMT'].sum()
    return mydollars

In [37]:
#loding the dataset and giving the column headding
myDF = pd.read_csv("/anvil/projects/tdm/data/election/itcont1980.txt", header=None, sep='|')
myDF.columns = ["CMTE_ID", "AMNDT_IND", "RPT_TP", "TRANSACTION_PGI", "IMAGE_NUM", "TRANSACTION_TP", "ENTITY_TP", "NAME", "CITY", "STATE", "ZIP_CODE", "EMPLOYER", "OCCUPATION", "TRANSACTION_DT", "TRANSACTION_AMT", "OTHER_ID", "TRAN_ID", "FILE_NUM", "MEMO_CD", "MEMO_TEXT", "SUB_ID"]

In [38]:
myDF.head() #printing the file

,CMTE_ID,AMNDT_IND,RPT_TP,TRANSACTION_PGI,IMAGE_NUM,TRANSACTION_TP,ENTITY_TP,NAME,CITY,STATE,...,EMPLOYER,OCCUPATION,TRANSACTION_DT,TRANSACTION_AMT,OTHER_ID,TRAN_ID,FILE_NUM,MEMO_CD,MEMO_TEXT,SUB_ID
0,C00078279,A,M11,P,80031492155,22Y,NaN,"MCKENNON, K R",MIDLAND,MI,...,NaN,NaN,10031979.0,400,NaN,NaN,NaN,NaN,CONTRIBUTION REF TO INDIVIDUAL,3062020110011466469
1,C00078279,A,M11,NaN,79031415137,15,NaN,"OREFFICE, P",MIDLAND,MI,...,DOW CHEMICAL CO,NaN,10261979.0,1500,NaN,NaN,NaN,NaN,NaN,3061920110000382948
2,C00078279,A,M11,NaN,79031415137,15,NaN,"DOWNEY, J",MIDLAND,MI,...,DOW CHEMICAL CO,NaN,10261979.0,300,NaN,NaN,NaN,NaN,NaN,3061920110000382949
3,C00078279,A,M11,NaN,79031415137,15,NaN,"BLAIR, E",MIDLAND,MI,...,DOW CHEMICAL CO,NaN,10261979.0,1000,NaN,NaN,NaN,NaN,NaN,3061920110000382950
4,C00078287,A,Q1,NaN,79031231889,15,NaN,"BLANCHARD, JOHN A",CHICAGO,IL,...,NaN,NaN,3201979.0,200,NaN,NaN,NaN,NaN,NaN,3061920110000383914

In [39]:
#Converting date column to datetime format
myDF['TRANSACTION_DT'] = pd.to_datetime(myDF['TRANSACTION_DT'], errors='coerce')

In [40]:
#using the funtion
popular_election_date, election_date_count = mostpopulardate(myDF['TRANSACTION_DT'])

In [41]:
#displaying the output
print(f"Most popular transaction date in the 1980 election data: {popular_election_date}, occurred {election_date_count} times.")

Most popular transaction date in the 1980 election data: 1970-01-01 00:00:00.012311979, occurred 2562 times.

## 5

Part a

In [1]:
import pandas as pd

# Define the function myaveragedelay
def myaveragedelay(airport_code: str) -> float:
    """
    The myaveragedelay function takes a 3-letter airport code and calculates 
    the average departure delay from the DepDelay column, after removing NA values.

    Args:
    airport_code (str): The 3-letter airport code (e.g., "IND", "JFK").

    Returns:
    float: The average departure delay for flights from the given airport.
    """
    # Load the 1990 flight data
    myDF = pd.read_csv('/anvil/projects/tdm/data/flights/subset/1990.csv')

    # Filter flights by the given airport code
    airport_flights = myDF[myDF["Origin"] == airport_code]

    # Calculate the average departure delay after removing NA values
    avg_delay = airport_flights["DepDelay"].dropna().mean()

    return avg_delay

Part b

In [2]:
#to print the average departure delay for IND. Took help from GeeksForGeeks
ind_delay = myaveragedelay("IND")
print(f"Average departure delay for IND: {ind_delay}")

Average departure delay for IND: 5.9697722567287785

Part c

In [3]:
#to print the average departure delay for JFK
jfk_delay = myaveragedelay("JFK")
print(f"Average departure delay for JFK: {jfk_delay}")

Average departure delay for JFK: 11.857274106360704